# ~/dotfiles/Brewfile — regenerate with: brew bundle dump --force --describe --file=~/dotfiles/Brewfile
# Apply with: brew bundle --file=~/dotfiles/Brewfile

# --- CLI foundation ---
brew "git"
brew "gh"                    # GitHub CLI
brew "ripgrep"               # rg — grep
brew "fd"                    # find
brew "eza"                   # ls
brew "bat"                   # cat
brew "zoxide"                # cd (z)
brew "fzf"                   # fuzzy finder
brew "git-delta"             # git diff pager
brew "jq"
brew "yq"
brew "duti"                  # set default app handlers (e.g. default terminal)
brew "starship"              # prompt
brew "mise"                  # runtime version manager (node/go/rust/...)
brew "uv"                    # Python: versions + projects + tools
brew "tmux"
brew "htop"
brew "curl"
brew "wget"
brew "coreutils"             # GNU utils, g-prefixed (gsed, gdate, ...)
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Dev CLI quality-of-life ---
brew "lazygit"               # git TUI
brew "btop"                  # system monitor TUI
brew "git-lfs"
brew "tealdeer"              # tldr (fast man-page examples)
brew "dust"                  # du, visual
brew "hyperfine"             # benchmarking
brew "gnupg"

# --- Database clients (containerized DBs, host clients) ---
brew "libpq"                 # psql, pg_dump (keg-only; PATH set in .zshrc)
brew "redis"                 # redis-cli

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"  # Apple SF Mono + icons

# --- GUI apps ---
cask "ghostty"               # terminal
cask "visual-studio-code"
cask "orbstack"              # containers (Docker-compatible, lightweight)
cask "raycast"               # launcher / Spotlight replacement
cask "alt-tab"               # window-level ⌘-Tab
cask "rectangle"             # keyboard window snapping
cask "maccy"                 # clipboard history
cask "jordanbaird-ice"       # menu bar manager (Bartender alternative)
cask "stats"                 # menu bar system monitor
cask "karabiner-elements"    # key remapping (PrtSc → screenshot-to-clipboard)
